#pandas as an open source library which is used to handle data manuplation

In [1]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2024.1)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\lenovo\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ----------------- ---------------------- 5.0/11.5 MB 30.2 MB/s eta 0:00:01
   --------------------------------- ------ 9.7/11.5 MB 24.1 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 22.7 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 18.4 MB/s eta 0:00:00
Downloading tzdata-2025.1-py2.py3-none-any.whl (346 kB)
Installing collected packages: tzdata, pandas
Successfully installed pandas-2.2.3 tzdata-2025.1

In [2]:
#data structure of pandas
# 1. Series (onedimensional array)
# 2. DataFrame (multi dimentional array)

series

In [3]:
import pandas as pd

In [4]:
a=pd.Series([1,2,3])
a

0    1
1    2
2    3
dtype: int64

In [5]:
#dataframe

In [7]:
a={
    "empid":[1,2,3],
    "empname":["ravi","devesh","naina"],
    "dept":["hr","it","sales"],
    "salary":[10000,20000,30000]
    
}
type(a)

dict

In [8]:
df=pd.DataFrame(a)
df

   empid empname   dept  salary
0      1    ravi     hr   10000
1      2  devesh     it   20000
2      3   naina  sales   30000

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
#export file in folder 
#syntax > df.to_csv("path//filename ")
df.to_csv("D:\\pandas\\emp_info.csv")

In [11]:
#import file from folder 
#open a folder in which yoy have datasets
# copy the folder locatio/n
# paste it into jupyter
# df=pd.read_csv("pasterfolderlocation//filename.csv")
#method 1

In [20]:
df=pd.read_csv("D:\\pandas\\emp_info.csv")
df#we also use df.head()

   Unnamed: 0  empid empname   dept  salary
0           0      1    ravi     hr   10000
1           1      2  devesh     it   20000
2           2      3   naina  sales   30000

In [21]:
#method 2 to import file in jyputer
#firtly going homepage in jupyter then upload file and open it 
#and then pd.read_csv("")

In [23]:
df=pd.read_csv("emp_info.csv")
df

   Unnamed: 0  empid empname   dept  salary
0           0      1    ravi     hr   10000
1           1      2  devesh     it   20000
2           2      3   naina  sales   30000

In [59]:
import pandas as pd

In [60]:
studen={
        "stu_id"  :[1,2,3,4,5,6,7,8,9,10],
        "stu_name":["chirag","riya","nupur","diya","kashish","chelsi","arun","lalit","ashu","ananya"],
        "semster" :[1,2,3,4,5,1,2,3,4,5],
        "dept"    :["it","cs","data","cs","networking","data","Networking","cs","it","cloud"],
        "stu_city":["kota","indergarh","jaipur","anta","ramganjmanedi","dudu","dausa","sawaimadhopur","neemuch","ajmer"]
    
}

print(studen)

{'stu_id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 'stu_name': ['chirag', 'riya', 'nupur', 'diya', 'kashish', 'chelsi', 'arun', 'lalit', 'ashu', 'ananya'], 'semster': [1, 2, 3, 4, 5, 1, 2, 3, 4, 5], 'dept': ['it', 'cs', 'data', 'cs', 'networking', 'data', 'Networking', 'cs', 'it', 'cloud'], 'stu_city': ['kota', 'indergarh', 'jaipur', 'anta', 'ramganjmanedi', 'dudu', 'dausa', 'sawaimadhopur', 'neemuch', 'ajmer']}

In [62]:
sf=pd.DataFrame(studen)

In [63]:
sf

   stu_id stu_name  semster        dept       stu_city
0       1   chirag        1          it           kota
1       2     riya        2          cs      indergarh
2       3    nupur        3        data         jaipur
3       4     diya        4          cs           anta
4       5  kashish        5  networking  ramganjmanedi
5       6   chelsi        1        data           dudu
6       7     arun        2  Networking          dausa
7       8    lalit        3          cs  sawaimadhopur
8       9     ashu        4          it        neemuch
9      10   ananya        5       cloud          ajmer

In [64]:
sf.to_csv("D://pandas//nupu.csv")

In [65]:
sf

   stu_id stu_name  semster        dept       stu_city
0       1   chirag        1          it           kota
1       2     riya        2          cs      indergarh
2       3    nupur        3        data         jaipur
3       4     diya        4          cs           anta
4       5  kashish        5  networking  ramganjmanedi
5       6   chelsi        1        data           dudu
6       7     arun        2  Networking          dausa
7       8    lalit        3          cs  sawaimadhopur
8       9     ashu        4          it        neemuch
9      10   ananya        5       cloud          ajmer